import React from "react";
import styled from "styled-components";
import { RiKakaoTalkLine } from "react-icons/ri";
import { FaInstagram } from "react-icons/fa";
import { Link } from "react-router-dom";

const FooterContainer = styled.footer`
  background-color: #f0f0f2;
  text-align: left;
  color: #a2a2a4;
  height: 257px;
`;

const TopContainer = styled.div`
  display: flex;
  justify-content: space-between;
  align-items: center;
  height: 78px;
  border-bottom: 1px solid #dee2e6;
  padding: 15px 72px;

  @media (max-width: 768px) {
    flex-direction: column;
    align-items: flex-start;
    padding: 15px 20px;
    gap: 10px;
  }
`;

const ButtonContainer = styled.div`
  display: flex;
  gap: 22px;

  @media (max-width: 768px) {
    flex-wrap: wrap;
    gap: 15px;
  }
`;

const Button = styled(Link)`
  font-weight: 400;
  font-size: 13.23px;
  line-height: 14px;
  letter-spacing: 0.15px;
  text-decoration: none;
  cursor: pointer;
  font-weight: 400;

  &:hover {
    font-weight: 700;
  }
`;

const IconContainer = styled.div`
  display: flex;
  gap: 15px;
  font-size: 25px;
`;

const RightIcons = styled.div`
  display: flex;
  align-items: center;
`;

const GlobeANDSelect = styled.div`
  display: flex;
  align-items: center;
  gap: 12px;
  margin-left: 42px;
  select {
    padding: 9px 33px 9px 29px;
    border: 1px solid #d2d2d3;
  }
`;

const BottomContainer = styled.div`
  display: flex;
  align-items: center;
  height: 179px;
  font-size: 13.31px;
  line-height: 11px;
  font-weight: 400;
  letter-spacing: 0.15px;
  padding: 48px 70px 74px 70px;
`;

const InfoContainer = styled.div`
  display: flex;
  flex-direction: column;
  gap: 10px;
  font-weight: 400;
`;

const ContactContainer = styled.div`
  display: flex;
  flex-direction: column;
  font-size: 13px;
  gap: 20px;
`;

const Footer = () => {
  return (
    <FooterContainer>
      <TopContainer>
        <ButtonContainer>
          <Button to={""}>이용약관</Button>|
          <Button to={""}>개인정보처리방침</Button>|
          <Button to={""}>EULA</Button>|<Button to={""}>파트너 신청</Button>|
          <Button to={"/faq"}>고객센터</Button>|
          <Button to={"/faq"}>공지사항</Button>
        </ButtonContainer>
        <RightIcons>
          <IconContainer>
            <svg
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <mask
                id="mask0_100_2028"
                maskUnits="userSpaceOnUse"
                x="0"
                y="0"
                width="20"
                height="20"
              >
                <path d="M19.4531 0H0.541016V20H19.4531V0Z" fill="white" />
              </mask>
              <g mask="url(#mask0_100_2028)">
                <path
                  d="M9.99708 0C4.77741 0 0.541016 3.91213 0.541016 8.74477C0.541016 12.3117 2.03683 14.0167 4.07658 15.5649H4.08704V19.749C4.08704 19.9477 4.31716 20.0628 4.47407 19.9372L8.06193 17.2699L8.13515 17.3013C8.73139 17.4163 9.359 17.4686 9.99708 17.4686C15.2167 17.4686 19.4531 13.5565 19.4531 8.72385C19.4531 3.89121 15.2167 0 9.99708 0ZM6.82762 10.9623C7.75858 10.9623 8.5431 10.4079 8.78369 9.55021H10.154C9.81926 11.2029 8.53264 12.2803 6.82762 12.2803C4.84018 12.2803 3.26068 10.795 3.26068 8.73431C3.26068 6.67364 4.84018 5.18828 6.82762 5.18828C8.55356 5.18828 9.85063 6.29707 10.1644 7.97071H8.79415C8.58495 7.06067 7.76905 6.48535 6.81716 6.48535C5.47825 6.48535 4.58913 7.43724 4.58913 8.73431C4.58913 10.0314 5.61423 10.9623 6.82762 10.9623ZM15.8548 12.1444H14.5996V9.30962C14.5996 8.66109 14.223 8.30544 13.6372 8.30544C12.9887 8.30544 12.5703 8.70293 12.5703 9.51883V12.1444H11.3151V5.2092H12.5703V7.81381C12.8736 7.35356 13.3548 7.13389 14.0243 7.13389C14.5577 7.13389 14.9971 7.31172 15.3422 7.66736C15.6979 8.02301 15.8653 8.51464 15.8653 9.15272V12.1444H15.8548Z"
                  fill="#6D6D70"
                />
              </g>
            </svg>
            <svg
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M20 10C20 4.47715 15.5228 0 10 0C4.47715 0 0 4.47715 0 10C0 15.5228 4.47715 20 10 20C15.5228 20 20 15.5228 20 10Z"
                fill="#6D6D70"
              />
              <path
                d="M9.99936 6.66602C9.1153 6.66602 8.26746 7.01721 7.64234 7.64233C7.01721 8.26745 6.66602 9.11529 6.66602 9.99935C6.66602 10.8834 7.01721 11.7313 7.64234 12.3564C8.26746 12.9815 9.1153 13.3327 9.99936 13.3327C10.8834 13.3327 11.7312 12.9815 12.3564 12.3564C12.9815 11.7313 13.3327 10.8834 13.3327 9.99935C13.3327 9.11529 12.9815 8.26745 12.3564 7.64233C11.7312 7.01721 10.8834 6.66602 9.99936 6.66602ZM9.99936 12.1641C9.42503 12.1641 8.87422 11.936 8.46811 11.5299C8.062 11.1238 7.83384 10.573 7.83384 9.99863C7.83384 9.4243 8.062 8.87349 8.46811 8.46738C8.87422 8.06127 9.42503 7.83312 9.99936 7.83312C10.5737 7.83312 11.1245 8.06127 11.5306 8.46738C11.9367 8.87349 12.1649 9.4243 12.1649 9.99863C12.1649 10.573 11.9367 11.1238 11.5306 11.5299C11.1245 11.936 10.5737 12.1641 9.99936 12.1641Z"
                fill="white"
              />
              <path
                d="M13.3333 7.50065C13.7936 7.50065 14.1667 7.12756 14.1667 6.66732C14.1667 6.20708 13.7936 5.83398 13.3333 5.83398C12.8731 5.83398 12.5 6.20708 12.5 6.66732C12.5 7.12756 12.8731 7.50065 13.3333 7.50065Z"
                fill="white"
              />
              <path
                d="M16.3142 5.63013C16.1427 5.18819 15.8808 4.78684 15.5451 4.45179C15.2094 4.11674 14.8073 3.85536 14.3646 3.68439C13.8466 3.49023 13.2993 3.38525 12.7461 3.3739C12.0331 3.34286 11.8073 3.33398 9.99916 3.33398C8.19108 3.33398 7.95933 3.33398 7.25223 3.3739C6.69943 3.38467 6.15254 3.48967 5.63518 3.68439C5.19236 3.85517 4.79019 4.11647 4.45447 4.45155C4.11874 4.78662 3.85688 5.18807 3.68567 5.63013C3.49117 6.14733 3.38626 6.69381 3.37544 7.24616C3.3436 7.95733 3.33398 8.1828 3.33398 9.98882C3.33398 11.7941 3.33398 12.024 3.37544 12.7315C3.38655 13.2845 3.49094 13.83 3.68567 14.3483C3.85736 14.7902 4.11948 15.1914 4.45528 15.5265C4.79109 15.8615 5.1932 16.1229 5.63592 16.294C6.1523 16.496 6.69942 16.6085 7.25372 16.6267C7.96673 16.6577 8.19256 16.6673 10.0007 16.6673C11.8087 16.6673 12.0405 16.6673 12.7476 16.6267C13.3008 16.6154 13.848 16.5107 14.3661 16.3169C14.8087 16.1455 15.2107 15.8839 15.5463 15.5488C15.882 15.2136 16.144 14.8123 16.3156 14.3704C16.5104 13.8529 16.6148 13.3074 16.6259 12.7544C16.6577 12.0432 16.6673 11.8178 16.6673 10.0117C16.6673 8.20572 16.6673 7.97655 16.6259 7.26908C16.6172 6.70892 16.5118 6.15445 16.3142 5.63013ZM15.4123 12.6768C15.4076 13.1028 15.3297 13.5249 15.1821 13.9247C15.0709 14.2121 14.9006 14.4732 14.6823 14.691C14.464 14.9089 14.2025 15.0787 13.9145 15.1895C13.5185 15.3362 13.1003 15.414 12.678 15.4194C11.9746 15.452 11.7762 15.4601 9.97251 15.4601C8.16738 15.4601 7.98302 15.4601 7.2663 15.4194C6.84421 15.4143 6.42618 15.3365 6.03056 15.1895C5.74156 15.0794 5.47895 14.9099 5.25971 14.692C5.04046 14.4741 4.86947 14.2127 4.75779 13.9247C4.61226 13.5292 4.53441 13.1121 4.52752 12.6908C4.49568 11.9885 4.48828 11.7904 4.48828 9.98956C4.48828 8.18798 4.48828 8.0039 4.52752 7.28756C4.53231 6.86176 4.61019 6.43993 4.75779 6.04042C4.98361 5.45715 5.44637 4.99806 6.03056 4.77481C6.42637 4.62854 6.84429 4.55078 7.2663 4.5449C7.97043 4.51311 8.16812 4.50424 9.97251 4.50424C11.7769 4.50424 11.962 4.50424 12.678 4.5449C13.1003 4.54997 13.5186 4.62775 13.9145 4.77481C14.2024 4.8859 14.464 5.05588 14.6823 5.27383C14.9006 5.49179 15.0708 5.7529 15.1821 6.04042C15.3276 6.43589 15.4054 6.85299 15.4123 7.27425C15.4442 7.97729 15.4523 8.17467 15.4523 9.97625C15.4523 11.7771 15.4523 11.9708 15.4205 12.6775L15.4123 12.6768Z"
                fill="white"
              />
            </svg>
          </IconContainer>
          <GlobeANDSelect>
            <svg
              width="18"
              height="18"
              viewBox="0 0 18 18"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <mask
                id="mask0_100_2042"
                maskUnits="userSpaceOnUse"
                x="0"
                y="0"
                width="18"
                height="18"
              >
                <path d="M18 0H0V18H18V0Z" fill="white" />
              </mask>
              <g mask="url(#mask0_100_2042)">
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M9 17.3C13.584 17.3 17.3 13.584 17.3 9C17.3 4.41604 13.584 0.7 9 0.7C4.41604 0.7 0.7 4.41604 0.7 9C0.7 13.584 4.41604 17.3 9 17.3ZM9 18C13.9706 18 18 13.9706 18 9C18 4.02944 13.9706 0 9 0C4.02944 0 0 4.02944 0 9C0 13.9706 4.02944 18 9 18Z"
                  fill="black"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M11.7549 15.0362C12.5546 13.5272 13.0705 11.3943 13.0705 9C13.0705 6.6057 12.5546 4.47279 11.7549 2.96384C10.9387 1.42377 9.93101 0.7 9.00046 0.7C8.06991 0.7 7.06231 1.42377 6.24607 2.96384C5.44633 4.47279 4.93047 6.6057 4.93047 9C4.93047 11.3943 5.44633 13.5272 6.24607 15.0362C7.06231 16.5762 8.06991 17.3 9.00046 17.3C9.93101 17.3 10.9387 16.5762 11.7549 15.0362ZM9.00046 18C11.6349 18 13.7705 13.9706 13.7705 9C13.7705 4.02944 11.6349 0 9.00046 0C6.36606 0 4.23047 4.02944 4.23047 9C4.23047 13.9706 6.36606 18 9.00046 18Z"
                  fill="black"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M9.00089 4.77558C11.4018 4.77558 13.5622 4.1986 15.1235 3.28027L15.4783 3.88364C13.7929 4.87501 11.5058 5.47558 9.00089 5.47558C6.49598 5.47558 4.20891 4.87501 2.52344 3.88363L2.87834 3.28027C4.43963 4.1986 6.59999 4.77558 9.00089 4.77558Z"
                  fill="black"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M15.1235 14.7149C13.5622 13.7965 11.4018 13.2195 9.00089 13.2195C6.59999 13.2195 4.43963 13.7965 2.87834 14.7149L2.52344 14.1115C4.20891 13.1201 6.49598 12.5195 9.00089 12.5195C11.5058 12.5195 13.7929 13.1201 15.4783 14.1115L15.1235 14.7149Z"
                  fill="black"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M17.5492 9.35039H0.449219V8.65039H17.5492V9.35039Z"
                  fill="black"
                />
                <path
                  fillRule="evenodd"
                  clipRule="evenodd"
                  d="M8.65039 17.5502V0.450195H9.35039V17.5502H8.65039Z"
                  fill="black"
                />
              </g>
            </svg>
            <select name="" id="">
              <option value="">한국어</option>
              <option value="">영어</option>
            </select>
          </GlobeANDSelect>
        </RightIcons>
      </TopContainer>
      <BottomContainer>
        <ContactContainer>
          <InfoContainer>
            <span>고객센터</span>
            <p>
              전화: 010-2168-9070 &nbsp; 이메일: onetoolfirst@gmail.com &nbsp;
              민원접수: onetoolfirst@gmail.com
            </p>
          </InfoContainer>
          <InfoContainer>
            <p>
              상호명: 원툴 &nbsp; 대표: 정재민 &nbsp; 사업장주소: 서울특별시
              송파구 동남로 9길 53, 202호(가락동) &nbsp; 사업자등록번호:
              690-95-01701
            </p>
            <p>
              개인정보관리자: 정재민 &nbsp; 번호(발신전용): 02-878-1201 &nbsp;
              유선전화: 010-2168-9070 &nbsp; 이메일: onetoolfirst@gmail.com
            </p>
            <p>
              호스팅제공: Amazon Web Service(AWS) &nbsp; copyright (c)
              www.onetool.com all rights reserved.
            </p>
          </InfoContainer>
        </ContactContainer>
      </BottomContainer>
    </FooterContainer>
  );
};

export default Footer;
